[{"pk":1,"name":"Computer Science Capstone Project","code":"EECS4088","nickname":"EECS 4088","faculty":1,"credit":6,"lang":"En","about":"A project in computer science chosen in consultation with, and supervised by, a member of the department. Prerequisites: cumulative GPA of 4.50 or better over all major EECS courses (without second digit \"5\"); LE/EECS 2030 3.00 or LE/EECS 1030 3.00; permission of the Instructor. Normally restricted to students who have taken 36 credits in computer science. Course credit exclusions: LE/EECS 4080 3.00, LE/EECS 4081 6.00, LE/EECS 4082 6.00, LE/EECS 4084 6.00, LE/EECS 4480 3.00, LE/EECS 4700 6.00, LE/ENG 4000 6.00. PRIOR TO FALL 2014: course credit exclusions: LE/CSE 4080 3.00, LE/CSE 4081 6.00, LE/CSE 4082 6.00, LE/CSE 4084 6.00, LE/CSE 4480 3.00, LE/CSE 4700 6.00. PRIOR TO SUMMER 2013: course credit exclusions: SC/CSE 4080 3.00, SC/CSE 4081 6.00, SC/CSE 4082 6.00, SC/CSE 4084 6.00, SC/CSE 4480 3.00, , SC/ENG 4000 6.00."},{"pk":2,"name":"Building E-Commerce Systems","code":"EECS4413","nickname":"EECS 4413","faculty":1,"credit":3,"lang":"En","about":"A study of the technical infrastructure that underlies Electronic Commerce on the Internet. The foundational concepts are presented through a series of projects that use an industrial-strength framework on the server side, standard-compliant technologies on the client side, and a variety of messaging protocols on the network side. Best practices, security concerns, and performance issues are emphasized throughout. Prerequisite: cumulative GPA of 4.50 or better over all major EECS courses (without second digit \"5\"); LE/EECS 2030 3.00 or LE/EECS 1030 3.00; LE/EECS 2011 3.00. Previously offered as: LE/CSE 4413 3.00."},{"pk":3,"name":"Introduction to Computing for Psychology","code":"EECS1570","nickname":"EECS 1570","faculty":1,"credit":3,"lang":"En","about":"An introduction to computing concepts with applications to problems drawn from psychology, including concepts of computer programming in an integrated computing and visualization environment. Prerequisite: SC/MATH 1505 6.00. Course credit exclusions: LE/EECS 1541 3.00, LE/EECS 1560 3.00. PRIOR TO FALL 2014: course credit exclusions: LE/CSE 1541 3.00, LE/CSE 1560 3.00. PRIOR TO SUMMER 2013: course credit exclusions: SC/CSE 1541 3.00, SC/CSE 1560 3.00."},{"pk":4,"name":"Analog Integrated Circuit Design","code":"EECS3611","nickname":"EECS 3611","faculty":1,"credit":4,"lang":"En","about":"This course focuses on the analysis and design of analog integrated circuit in CMOS technology. It covers the aspects of circuit design from single transistor operation to complex amplifiers and layout techniques as well as the process and modeling background. Prerequisites: cumulative GPA of 4.50 or better over all major EECS courses (without second digit \"\"5\"\"); LE/EECS 2030 3.00 or LE/EECS 1030 3.00; LE/EECS 2210 3.00."},{"pk":5,"name":"Professional Practice in Computing","code":"EECS3000","nickname":"EECS 3000","faculty":1,"credit":3,"lang":"En","about":"Professional, legal and ethical issues in the development, deployment and use of computer systems; their impact on society including privacy and security, computer crime, malware, and intellectual property; professional ethics and responsibilities; guest lecturers from industry, government and university. Prerequisites: cumulative GPA of 4.50 or better over all major EECS courses (without second digit \"5\"); LE/EECS 2030 3.00 or LE/EECS 1030 3.00. Course credit exclusions: LE/ENG 4000 6.00, SC/ENG 4000 6.00 (prior to Summer 2013)."},{"pk":6,"name":"Fundamentals of Data Structures","code":"EECS2011","nickname":"EECS 2011","faculty":1,"credit":3,"lang":"En","about":"A study of fundamental data structures and their use in the efficient implementation of algorithms. Topics include abstract data types, lists, stacks, queues, trees and graphs. Prerequisites: cumulative GPA of 4.50 or better over all major EECS courses (without second digit \"5\"); LE/EECS 1030 3.00 or LE/EECS 2030 3.00; LE/EECS 1028 3.00 OR SC/MATH 1028 3.00 or LE/EECS 1019 3.00 or SC/MATH 1019 3.00. Previously offered as: LE/CSE 2011 3.00."},{"pk":7,"name":"Computer Security Project","code":"EECS4480","nickname":"EECS 4480","faculty":1,"credit":3,"lang":"En","about":"This is a capstone project course for computer security students. The students engage in a significant research and/or development project that has major computer security considerations. Prerequisites: Restricted to students in the Computer Security degree. Students must have passed 40 EECS or CSE credits. Permission of the Instructor is needed. Course credit exclusions: LE/EECS 4080 3.00; LE/EECS 4081 6.00; LE/EECS 4082 6.00; LE/EECS 4084 6.00; LE/EECS 4088 6.00; LE/EECS 4700 6.00. PRIOR TO FALL 2014: course credit exclusions: LE/CSE 4080 3.00, LE/CSE 4081 6.00, LE/CSE 4084 6.00, LE/CSE 4088 6.00, LE/CSE 4700 6.00, LE/CSE 4082 6.00. PRIOR TO SUMMER 2013: course credit exclusions: SC/CSE 4080 3.00, SC/CSE 4081 6.00, SC/CSE 4084 6.00, SC/CSE 4088 6.00, SC/CSE 4700 6.00, SC/CSE 4082 6.00."},{"pk":8,"name":"Operating System Design","code":"EECS4221","nickname":"EECS 4221","faculty":1,"credit":3,"lang":"En","about":"An operating system has four major components: process management, input/output, memory management, file system. This project-oriented course puts OS principles into action: design and implementation of components of an OS, interaction with existing system software (using C under Unix). Prerequisites: cumulative GPA of 4.50 or better over all major EECS courses (without second digit \"5\"); LE/EECS 2030 3.00 or LE/EECS 1030 3.00; LE/EECS 3221 3.00. Previously offered as: LE/CSE 4221 3.00."},{"pk":9,"name":"Advanced Object Oriented Programming","code":"EECS2030","nickname":"EECS 2030","faculty":1,"credit":3,"lang":"En","about":"This course continues the separation of concern theme introduced in LE/EECS 1020 3.00 and LE/EECS1021 3.00. While 1020 and 1021 focuses on the client concern, this course focuses on the concern of the implementer. Hence, rather than using an API (Application Programming Interface) to build an application, the student is asked to implement a given API. Topics include implementing classes (non-utilities, delegation within the class definition, documentation and API generation, implementing contracts), aggregations (implementing aggregates versus compositions and implementing collections), inheritance hierarchies (attribute visibility, overriding methods, abstract classes versus interfaces, inner classes); applications of aggregation and inheritance in concurrent programming and event-driven programming; recursion; searching and sorting including quick and merge sorts); stacks and queues; linked lists; binary trees. Prerequisites: cumulative GPA of 4.50 or better over all major EECS courses (without second digit \"5\"); LE/EECS1021 3.00 or LE/EECS 1020 (prior to Fall 2015) 3.00 or LE/EECS1022 3.00 or LE/EECS 1720 3.00. Course credit exclusions: AP/ITEC 2620 3.00. Previously offered as: LE/EECS1030 3.00, LE/CSE 1030 3.00."},{"pk":10,"name":"Discrete Mathematics for Engineers","code":"EECS1028","nickname":"EECS 1028","faculty":1,"credit":3,"lang":"En","about":"An introduction to propositional logic and application to switching circuits; sets, relations and functions; predicate logic and proof techniques; induction with applications to program correctness; basic counting techniques with applications; graphs and trees with applications in circuit analysis, information storage and retrieval, Huffman coding; automata and applications in software engineering. Prerequisites: MHF4U (Advanced Function) and MCV4U (Calculus and Vectors). Course Credit exclusions: LE/CSE 1019 3.00 (prior to Fall 2014), LE/EECS 1019 3.00, SC/CSE 1019 3.00 (prior to Summer 2013), SC/MATH 1019 3.00, SC/MATH 2320 3.00."},{"pk":11,"name":"Introduction to Virtual Reality","code":"EECS4471","nickname":"EECS 4471","faculty":1,"credit":3,"lang":"En","about":"Introduction to the basic principles of Virtual Reality and its applications. The necessary hardware and software components of interactive 3D systems as well as human factors are discussed. Prerequisites: cumulative GPA of 4.50 or better over all major EECS courses (without second digit \"5\"); SC/MATH 1025 3.00; SC/MATH 1310 3.00; LE/EECS 3431 3.00"},{"pk":12,"name":"Signals and Systems in Continuous Time","code":"EECS2602","nickname":"EECS 2602","faculty":1,"credit":4,"lang":"En","about":"Introduces continuous-time (analogue) signals including an analysis and design of continuous-time systems. After reviewing core concepts in complex numbers, trigonometry, and functions, the course considers three alternate representations (differential equations, impulse response, and Laplace/Fourier transfer function) for linear, time invariant (LTI) systems in the continuous-time domain. The analysis of LTI systems is covered for each of the three representations. Frequency-selective filters are introduced as a special class of LTI systems for which design techniques based on Butterworth, Chebyshev, and Elliptic filters are covered. Applications of continuous-time systems in communications and controls are also presented. Prerequisites: cumulative GPA of 4.50 or better over all major EECS courses (without second digit \"5\"); SC/MATH 1014 3.00, SC/MATH 1025 3.00. Course credit exclusions: LE/EECS 3451 4.00, LE/CSE 3451 4.00 (prior to Fall 2014), SC/CSE 3451 4.00 (prior to Summer 2013)."},{"pk":13,"name":"Programming for Digital Media","code":"EECS1710","nickname":"EECS 1710","faculty":1,"credit":3,"lang":"En","about":"Introduction to program design and implementation focusing on digital media projects including sound, images, and animation; includes algorithms, simple data structures, control structures, and debugging techniques. Course credit exclusions: LE/EECS 1530 3.00, LE/CSE 1530 3.00, SC/CSE 1530 3.00, AP/ITEC 1620 3.00. NCR: Students who completed or are taking LE/EECS 1021 3.00 or LE/EECS 1022 3.00 or LE/EECS 1020 3.00 or LE/CSE 1020 3.00, SC/CSE 1020 3.00."},{"pk":14,"name":"Data Mining","code":"EECS4412","nickname":"EECS 4412","faculty":1,"credit":3,"lang":"En","about":"Introduces and presents basic concepts of data mining, data mining techniques, models and applications. Topics include association rule mining, classification models, sequential pattern mining and clustering. Prerequisites: cumulative GPA of 4.50 or better over all major EECS courses (without second digit \"5\"); LE/EECS 2030 3.00 or LE/EECS 1030 3.00; LE/EECS 3101 3.00, LE/EECS 3421 3.00 and one of SC/MATH 2030 3.00 or SC/MATH 2930 3.00 or SC/MATH 1131 3.00. Previously offered as: LE/CSE 4412 3.00."},{"pk":15,"name":"Introduction to Computer Security","code":"EECS3482","nickname":"EECS 3482","faculty":1,"credit":3,"lang":"En","about":"Introduces fundamental computer security concepts. Topics include security goals and terminology, an overview of the various security domains, an introduction to cryptography, security policies, risk management and auditing. Laboratory exercises emphasize these topics in a practical manner. Prerequisites: Any 12 university credits at the 2000-level in any discipline."},{"pk":16,"name":"Electromagnetic theory and wave propagation","code":"EECS3604","nickname":"EECS 3604","faculty":1,"credit":4,"lang":"En","about":"Provides the student with an introduction to partial differential equations and the mathematics of wave propagation. Specific applications to electromagnetic waves are discussed. Guided waves, transmission lines, and antennas are also introduced. Prerequisites: cumulative GPA of 4.50 or better over all major EECS courses (without second digit \"5\"); LE/EECS 2030 3.00 or LE/EECS 1030 3.00; SC/MATH 1014 3.00 or SC/MATH 1025 3.00 or SC/PHYS 2020 3.00."},{"pk":17,"name":"Software Development Capstone Project","code":"EECS4090","nickname":"EECS 4090","faculty":1,"credit":6,"lang":"En","about":"Large-scale project involving all stages of the software development life cycle: requirements, analysis and design, implementation, testing and delivery. Team work. Open only to students in the Software Development Stream. Prerequisites: LE/EECS 3311 3.00 (with minimum grade of B), LE/EECS 3101 3.00, LE/EECS 3342 3.00. Corequisites: LE/EECS 4312 3.00, LE/EECS 4313 3.00."},{"pk":18,"name":"Introduction to 3D Computer Graphics","code":"EECS3431","nickname":"EECS 3431","faculty":1,"credit":3,"lang":"En","about":"Introduces the fundamental concepts and algorithms of three-dimensional computer graphics, including object modelling, transformations, cameras, visibility and shading. Prerequisites: cumulative GPA of 4.50 or better over all major EECS courses (without second digit \"5\"); LE/EECS 2030 3.00 or LE/EECS 1030 3.00; LE/EECS 2031 3.00, SC/MATH 1025 3.00. PRIOR TO FALL 2011: course credit exclusions: GL/CSLA 3635 3.00."},{"pk":19,"name":"Applied Cryptography","code":"EECS3481","nickname":"EECS 3481","faculty":1,"credit":3,"lang":"En","about":"An overview of cryptographic algorithms and the main cryptosystems in use today, emphasizing the application of cryptographic algorithms to designing secure protocols. Prerequisites: cumulative GPA of 4.50 or better over all major EECS courses (without second digit \"5\"); LE/EECS 2030 3.00 or LE/EECS 1030 3.00; LE/EECS 2011 3.00."},{"pk":20,"name":"Computer Security Management: Assessment and Forensics","code":"EECS4482","nickname":"EECS 4482","faculty":1,"credit":3,"lang":"En","about":"Examines the organizational policy and management aspects of computer security. It covers topics such as policies, procedures, and standards related to access and use, compliance and privacy, risk management and incident response. Prerequisites: 12 credits at the 3000-level."},{"pk":21,"name":"Digital Media Project","code":"EECS4700","nickname":"EECS 4700","faculty":1,"credit":6,"lang":"En","about":"This course involves the completion of a significant body of work in the area of Digital Media. The project will normally be a team project involving the development and analysis of a digital media work potentially having elements of interactivity, animation, 3-D graphics, and sound for example. The project will be presented at a public workshop towards the end of the year. Prerequisites: Only open to students in the final year of the Digital Media program. Course credit exclusions: LE/EECS 4080 3.00; LE/EECS 4081 6.00; LE/EECS 4082 6.00; LE/EECS 4084 6.00; LE/EECS 4088 6.00; LE/EECS 4480 3.00. PRIOR TO FALL 2014: course credit exclusions: LE/CSE 4080 3.00, LE/CSE 4081 6.00, LE/CSE 4082 6.00, LE/CSE 4084 6.00, LE/CSE 4088 6.00, LE/CSE 4480 3.00. PRIOR TO SUMMER 2013: course credit exclusions: SC/CSE 4080 3.00, SC/CSE 4081 6.00, SC/CSE 4082 6.00, SC/CSE 4084 6.00, SC/CSE 4088 6.00, SC/CSE 4480 3.00."},{"pk":22,"name":"Discrete Mathematics for Computer Science","code":"EECS1019","nickname":"EECS 1019","faculty":1,"credit":3,"lang":"En","about":"Introduction to abstraction. Use and development of precise formulations of mathematical ideas. Informal introduction to logic; introduction to naïve set theory; induction; relations and functions; big O-notation; recursive definitions, recurrence relations and their solutions; graphs and trees. Prerequisites: SC/MATH 1190 3.00, or two 4U Math courses, including MHF4U (Advanced Function). Course credit exclusions: LE/EECS 1028 3.00, SC/MATH 1028 3.00, SC/MATH 2320 3.00."},{"pk":23,"name":"Numerical Methods I","code":"EECS3121","nickname":"EECS 3121","faculty":1,"credit":3,"lang":"En","about":"An introductory course in computational linear algebra. Topics include simple error analysis, linear systems of equations, non-linear equations, linear least squares and interpolation. Prerequisites: One of SC/MATH 1010 3.00, SC/MATH 1014 3.00, SC/MATH 1310 3.00; one of SC/MATH 1021 3.00, SC/MATH 1025 3.00, SC/MATH 2221 3.00; one of LE/EECS 1540 3.00, LE/EECS 2031 3.00, or LE/EECS 2501 1.00. Course credit exclusions: LE/EECS 3121 3.00, LE/CSE 3121 3.00 (prior to Fall 2014), SC/CSE 3121 3.00 (prior to Summer 2013)."},{"pk":24,"name":"Communication Networks","code":"EECS3213","nickname":"EECS 3213","faculty":1,"credit":3,"lang":"En","about":"Introduces the basics of communications and networking. Topics include transmission media; fundamental limits; protocols and hierarchies; the OSI model; encoding of data as signals; error and flow control; medium access; routing; internetworking; transport services; high-level applications. Prerequisites: cumulative GPA of 4.50 or better over all major EECS courses (without second digit \"5\"); LE/EECS 2030 3.00 or LE/EECS 1030 3.00; SC/MATH 1310 3.00. Previously offered as: LE/CSE 3213 3.00. PRIOR TO SUMMER 2013: SC/CSE 3213 3.00."},{"pk":25,"name":"Digital Audio","code":"EECS4462","nickname":"EECS 4462","faculty":1,"credit":3,"lang":"En","about":"This course introduces the basic principles of digital audio, and presents several of its applications. Students will learn the physics of sound and the human auditory system, how analog audio is converted to digital, and the properties of different digital audio formats. They will also get hands-on experience with creating audio plugins for digital audio workstations, as well as creating sound engines for games. Prerequisites: cumulative GPA of 4.50 or better over all major EECS courses (without second digit \"5\"), LE/EECS 2031 3.00"},{"pk":26,"name":"Signals and Systems","code":"EECS3451","nickname":"EECS 3451","faculty":1,"credit":4,"lang":"En","about":"An introduction to the mathematical background in signals and systems; signal and image processing: sampling, discrete Fourier transform, filtering; linear system theory; Kalman filtering; feedback. Prerequisites: cumulative GPA of 4.50 or better over all major EECS courses (without second digit \"5\"); LE/EECS 2030 3.00 or LE/EECS 1030 3.00; LE/EECS 2021 4.00, SC/MATH 1310 3.00. Course credit exclusions: SC/MATH 4130B 3.00, SC/PHYS 4060 3.00. Previously offered as: LE/CSE 3451 4.00. PRIOR TO FALL 2014: course credit exclusions: SC/MATH 4830 3.00. PRIOR TO SUMMER 2013: course credit exclusions: SC/CSE 3451 4.00, SC/EATS 4020 3.00."},{"pk":27,"name":"Embedded Systems","code":"EECS3215","nickname":"EECS 3215","faculty":1,"credit":4,"lang":"En","about":"Introduction to the design of embedded systems using both hardware and software. Topics include microcontrollers; their architecture, and programming; design and implementation of embedded systems using field programmable gate arrays. Prerequisites: cumulative GPA of 4.50 or better over all major EECS courses (without second digit \"5\"); LE/EECS 2030 3.00 or LE/EECS 1030 3.00; LE/EECS 2031 3.00, LE/EECS 3201 4.00. Previously offered as: LE/CSE 3215 4.00. PRIOR TO SUMMER 2013: course credit exclusion: SC/CSE 3215 4.00."},{"pk":28,"name":"Mobile User Interfaces","code":"EECS4443","nickname":"EECS 4443","faculty":1,"credit":3,"lang":"En","about":"The design and implementation of user interfaces for touchscreen devices and tablet computers. Students develop user interfaces that include touch, multi-touch, vibration, device motion, position, and orientation, environment sensing, video capture, and audio capture. Twelve Supervised laboratory hours that emphasize these topics in a practical manner. Prerequisites: General prerequisite; LE/EECS 2030 3.00 or LE/EECS 1030 3.00; LE/EECS 3461 3.00. (NOTE: The General Prerequisite is a cumulative GPA of 4.50 or better over all major EECS courses. EECS courses with the second digit \"5\" are not major courses.)"},{"pk":29,"name":"Operating System Fundamentals","code":"EECS3221","nickname":"EECS 3221","faculty":1,"credit":3,"lang":"En","about":"Principles of operating systems. Concurrent processes, CPU scheduling, deadlocks, memory management, file systems, protection and security, and case studies. Prerequisites: cumulative GPA of 4.50 or better over all major EECS courses (without second digit \"5\"); LE/EECS 2030 3.00 or LE/EECS 1030 3.00; LE/EECS 2021 4.00 and LE/EECS 2031 3.00. Previously offered as: LE/CSE 3221 3.00"},{"pk":30,"name":"Industry Practicum","code":"EECS1910","nickname":"EECS 1910","faculty":1,"credit":3,"lang":"En","about":"This course is only available to students in the Industry Partnership Stream of the Computer Science Honours BSc (enrollment by permission). Students in the stream may enroll in the course during a term for which they are employed by the industrial partner. The learning outcomes of the course will be approved by the instructor prior to enrollment."},{"pk":31,"name":"Building Interactive Systems","code":"EECS1720","nickname":"EECS 1720","faculty":1,"credit":3,"lang":"En","about":"A second course teaching more advanced programming concepts within the context of image, sound and interaction using an object-oriented language; introduction to interactive systems, user interfaces, event-driven programming, object design and inheritance; implementation using debuggers, integrated development environments, user interface builders. Pre-requisites: LE/EECS 1710 3.00. Course credit exclusions: LE/EECS 1020 3.00, LE/EECS 1022 3.00, AP/ITEC 1620 3.00. PRIOR TO FALL 2014: course credit exclusions: LE/CSE 1020 3.00. PRIOR TO SUMMER 2013: course credit exclusions: SC/CSE 1020 3.00."},{"pk":32,"name":"Digital Logic Design","code":"EECS3201","nickname":"EECS 3201","faculty":1,"credit":4,"lang":"En","about":"Theory and design of logic circuits used in digital systems. Students will be introduced to transistors as devices, will learn how a transistor can be used as a switch, how to design switching circuits to implement logic gates, and how to use logic gates to construct combinational and sequential logic circuits and functional blocks. It also introduces the students to hardware description languages and modern CAD tools. Prerequisites: cumulative GPA of 4.50 or better over all major EECS courses (without second digit \"5\"); LE/EECS 2030 3.00 or LE/EECS 1030 3.00; LE/EECS 2021 4.00, LE/EECS 2200 3.00."},{"pk":33,"name":"Big Data Systems","code":"EECS4415","nickname":"EECS 4415","faculty":1,"credit":3,"lang":"En","about":"Storing, managing, and processing datasets are foundational to both computer science and data science. The enormous size of today's data sets and the specific requirements of modern applications necessitated the growth of a new generation of data management systems, where the emphasis is put on distributed and fault-tolerant processing. New programming paradigms have evolved, an abundance of information platforms offering data management and analysis solutions appeared and a number of novel methods and tools have been developed. This course introduces the fundamentals of big data storage, retrieval, and processing systems. As these fundamentals are introduced, exemplary technologies are used to illustrate how big data systems can leverage very large data sets that become available through multiple sources and are characterized by diverse levels of volume (terabytes; billion records), velocity (batch; real-time; streaming) and variety (structured; semi-structured; unstructured). The course aims to provide students with both theoretical knowledge and practical experience of the field by covering recent research on big data systems and their basic properties. Students consider both small and large datasets because both are equally important and justify different trade-offs. Topics include: software frameworks for distributed storage and processing of very large data sets, MapReduce programming model, querying of structured data sets, column stores, key-value stores, document stores, graph databases, distributed stream processing frameworks. Prerequisites: Cumulative GPA of 4.50 or better over all major EECS courses (without second digit \"5\"). General Prerequisites; LE/EECS 3421 3.00; LE/EECS 3101 3.00."},{"pk":34,"name":"Computational Thinking through Mechatronics","code":"EECS1011","nickname":"EECS 1011","faculty":1,"credit":3,"lang":"En","about":"The Objectives of 1011 are threefold: providing a first exposure to procedural programming, teaching students a set of soft computing skills (such as reasoning about algorithms, tracing programs, test-driven development), and demonstrating how computers are used in a variety of engineering disciplines. It uses problem-based pedagogy to expose the underlying concepts and an experiential laboratory to implement them. An integrated computing environment (such as MATLAB) is used so that students can pick up key programming concepts(such as variables and control flow) without being exposed to complex or abstract constructs. The problems are chosen with consultation with the various engineering disciplines in the Faculty with a view of exposing how computing is used in these disciplines. Course credit exclusions: LE/EECS1541 3.00."},{"pk":35,"name":"Digital Communications","code":"EECS4214","nickname":"EECS 4214","faculty":1,"credit":4,"lang":"En","about":"Introduces fundamental principles underlying design and analysis of digital communication systems. Develops mathematical/physical understanding from the information source through the transmitter, channel, receiver, and information sink. Topics include baseband transmission, matched filtering, modulation, channel coding, and spread spectrum. Prerequisites: cumulative GPA of 4.50 or better over all major EECS courses (without second digit \"5\"); LE/EECS 3213 3.00; One of SC/MATH 2030 3.00 or SC/MATH 2930 3.00; One of LE/EECS 3451 4.00, LE/EECS 3602 4.00, LE/ESSE 4020 3.00, SC/MATH 4830 3.00, SC/PHYS 4060 3.00 or SC/PHYS 4250 3.00. Previously offered as: LE/CSE 4214 4.00. PRIOR TO SUMMER 2013: course credit exclusion: SC/CSE 4214 4.00."},{"pk":36,"name":"Electrical Circuits","code":"EECS2200","nickname":"EECS 2200","faculty":1,"credit":3,"lang":"En","about":"This course covers the basic principles of linear circuits. Kirchhoff's laws, circuit equations, RL, RC, and RLC circuits, three-phase circuits, power analysis and power factor, and magnetically coupled circuits. Prerequisites: cumulative GPA of 4.50 or better over all major EECS courses (without second digit\"\"5\"); SC/PHYS 1010 6.00 or SC/PHYS 1801 3.00. Course credit exclusions: SC/PHYS 3050 3.00."},{"pk":37,"name":"Software Design","code":"EECS3311","nickname":"EECS 3311","faculty":1,"credit":3,"lang":"En","about":"A study of design methods and their use in the correct implementation, maintenance and evolution of software systems. Topics include design, implementation, testing, documentation needs and standards, support tools. Students design and implement components of a software system. Prerequisites: cumulative GPA of 4.50 or better over all major EECS courses (without second digit \"5\"); LE/EECS 2030 3.00 or LE/EECS 1030 3.00; LE/EECS 2011 3.00; SC/MATH 1090 3.00; LE/EECS 2031 3.00. Previously offered as: LE/CSE 3311 3.00. PRIOR TO SUMMER 2013: SC/CSE 3311 3.00."},{"pk":38,"name":"Numerical Methods II","code":"EECS3122","nickname":"EECS 3122","faculty":1,"credit":3,"lang":"En","about":"Algorithms and computer methods for solving problems of differentiation, integration, systems of non-linear equations and matrix eigenvalues. Prerequisite: SC/MATH 3241 3.00 or LE/EECS 3121 3.00. Course credit exclusions: LE/EECS 3122 3.00, LE/CSE 3122 3.00 (prior to Fall 2014), SC/CSE 3.00 (prior to Summer 2013)."},{"pk":39,"name":"Introduction to Computing for the Physical Sciences","code":"EECS1541","nickname":"EECS 1541","faculty":1,"credit":3,"lang":"En","about":"An introduction to scientific computing using an integrated computing and visualization platform. Elements of procedural programming such as: control structures, data types, program modules. Visualization in two and three dimensions. Applications to numerical computation and simulations relevant to the physical sciences. Prerequisite: SC/MATH 1013 3.00 or equivalent; Corequisites: SC/PHYS 1010 6.00 or SC/PHYS 1410 6.00 or SC/PHYS 1420 6.00; and SC/MATH 1021 3.00 or SC/MATH 1025 3.00. Course credit exclusions: LE/EECS 1011 3.00, LE/ EECS 1560 3.00, LE/EECS 1570 3.00. PRIOR TO FALL 2014: course credit exclusions: LE/CSE 1560 3.00, LE/SE1570 3.00. PRIOR TO SUMMER 2013: course credit exclusions: SC/CSE 1560 3.00, SC/CSE1570 3.00."},{"pk":40,"name":"Design and Analysis of Algorithms","code":"EECS3101","nickname":"EECS 3101","faculty":1,"credit":3,"lang":"En","about":"Review of fundamental data structures. Analysis of algorithms: time and space complexity. Algorithm design paradigms: divide-and-conquer, exploring graphs, greedy methods, local search, dynamic programming, probabilistic algorithms, computational geometry. NP-complete problems. Prerequisites: cumulative GPA of 4.50 or better over all major EECS courses (without second digit \"5\"); LE/EECS 2030 3.00 or LE/EECS 1030 3.00; LE/EECS 2011 3.00; SC/MATH 1090 3.00; SC/MATH 1310 3.00. Previously offered as: LE/CSE 3101 3.00. PRIOR TO SUMMER 2013: course credit exclusion: SC/CSE 3101 3.00."},{"pk":41,"name":"Computer Security Laboratory","code":"EECS4481","nickname":"EECS 4481","faculty":1,"credit":4,"lang":"En","about":"Provides a thorough understanding of the technical aspects of computer security. It covers network, operating systems, and application software security. Computer laboratory projects provide exposure to various tools in a hands-on setting. Prerequisites: cumulative GPA of 4.50 or better over all major EECS courses (without second digit \"5\"); LE/EECS 2030 3.00 or LE/EECS 1030 3.00; LE/EECS 3221 3.00; LE/EECS 3214 3.00. Note: Students with background equivalent to the stated prerequisites are encouraged to seek permission to enrol."},{"pk":42,"name":"Computer Security Internship Work Term","code":"EECS3980","nickname":"EECS 3980","faculty":1,"credit":0,"lang":"En","about":"This experiential education course reflects the work term component of the Technology Internship Program (TIP). Qualified Honours students gain relevant work experience as an integrated complement to their academic studies, reflected in the requirements of a learning agreement and work term report. Students are required to register in this course for each four month work term, with the maximum number of work term courses being four (i.e. 16 months). Students in this course receive assistance from the Career Centre prior to and during their internship, and are also assigned a Faculty Supervisor/Committee. Prerequisites: Enrolment is by permission only. Criteria for permission include: 1. that students have successfully completed at least nine EECS or CSE credits at the 3000-level including LE/EECS 3482 3.00 or LE/CSE 3482 3.00 or SC/CSE 3482 3.00, with a GPA of at least 6.00 in all mathematics and computer science courses completed; 2. that students are enrolled full-time in the Honours program prior to beginning their internship and have attended the mandatory preparatory sessions as outlined by the Career Centre; 3. that students have not been absent for more than two consecutive years as a full-time student from their Honours degree studies; 4. that upon enrolling in this course students have a minimum of nine credits remaining toward their Honours degree and need to return as a full-time student for at least one academic term to complete their degree after completion of their final work term. Registration in LE/EECS 3980 0.00 (formerly LE/CSE 3980 0.00, SC/CSE 3980 0.00) provides a record on the transcript for each work term."},{"pk":43,"name":"Introduction to Database Systems","code":"EECS3421","nickname":"EECS 3421","faculty":1,"credit":3,"lang":"En","about":"Concepts, approaches and techniques in database management systems (DBMS). Logical model of relational databases. An introduction to relational database design. Other topics such as query languages, crash recovery and concurrency control. Prerequisites: cumulative GPA of 4.50 or better over all major EECS courses (without second digit \"5\"); LE/EECS 2030 3.00 or LE/EECS 1030 3.00; Course credit exclusions: AP/ITEC 3220 3.00. Previously offered as: LE/CSE 3421 3.00. PRIOR TO SUMMER 2013: SC/CSE 3421 3.00."},{"pk":44,"name":"Computer Use: Fundamentals","code":"EECS1520","nickname":"EECS 1520","faculty":1,"credit":3,"lang":"En","about":"An introduction to the use of computers focusing on concepts of computer technology and organization (hardware and software) and the use of applications such as spreadsheets and information retrieval tools for problem solving. This course is designed for students who are not engineering or computer science majors. Students who plan to major in engineering or computer science are advised to take LE/EECS 1011 3.00 or LE/EECS 1012 3.00, respectively. Course credit exclusions: LE/CSE 1520 3.00, AK/AS/SC/CSE 1520 3.00. NCR Note: This course is not open to any student who has passed or is taking LE/EECS 1020 3.00, LE/CSE 1020 3.00, AK/AS/SC/CSE 1020 3.00, LE/EECS 1021 3.00, LE/EECS 1022 3.00."},{"pk":45,"name":"Advanced Software Engineering","code":"EECS4314","nickname":"EECS 4314","faculty":1,"credit":3,"lang":"En","about":"Advanced software engineering methods, processes and measurements (from requirements through to system evolution) for managing and delivering reliable software on time and within budget. Understanding the different types of systems and their associated technical, ethical and professional issues. Prerequisites: cumulative GPA of 4.50 or better over all major EECS courses (without second digit \"5\"); LE/EECS 2030 3.00 or LE/EECS 1030 3.00; LE/EECS 3311 3.00."},{"pk":46,"name":"Introduction to Computing for Mathematics and Statistics","code":"EECS1560","nickname":"EECS 1560","faculty":1,"credit":3,"lang":"En","about":"An introduction to scientific computing using an integrated computing and visualization environment. The course presents computer-based problem-solving techniques through a series of applications rooted in Mathematics and Statistics. Prerequisite: SC/MATH 1300 3.00: Corequisites: SC/MATH 1310 3.00; SC/MATH 1131 3.00 or SC/MATH 2030 3.00. Course credit exclusions: LE/EECS 1541 3.00, LE/EECS 1570 3.00. This course is not open to any student who has passed or is taking SC/PHYS 2030 3.00. PRIOR TO FALL 2014: course credit exclusions: LE/CSE 1541 3.00, LE/CSE 1570 3.00. PRIOR TO SUMMER 2013: course credit exclusions: SC/CSE 1541 3.00, SC/CSE 1570 3.00."},{"pk":47,"name":"Industry Practicum","code":"EECS1911","nickname":"EECS 1911","faculty":1,"credit":3,"lang":"En","about":"This course is only available to students in the Industry Partnership Stream of the Computer Science Honours BSc (enrollment by permission). Students in the stream may enroll in the course during a term for which they are employed by the industrial partner. The learning outcomes of the course will be approved by the instructor prior to enrollment."},{"pk":48,"name":"Research Directions in Computing","code":"EECS1001","nickname":"EECS 1001","faculty":1,"credit":1,"lang":"En","about":"An introduction to research directions within the department and more broadly within the field. Students will attend lectures and other events organised by the department. Note: This course is expected to be completed in the first-year of study."},{"pk":49,"name":"Electrical Systems for Mechanical Engineers","code":"EECS3505","nickname":"EECS 3505","faculty":1,"credit":3,"lang":"En","about":"Many mechanical systems today are integrated with electrical systems. This course will prepare students to work on electromechanical systems by introducing them to topics such as: The basics of circuit analysis and setup, as well as electronics; power systems including 3-phase; DC and AC motors; electro-mechanical actuators; and, time permitting, basics of communication protocols. Prerequisites: SC/PHYS 1801 3.00, LE/MECH 2502 3.00."},{"pk":50,"name":"Digital Signal Processing: Theory and Applications","code":"EECS4452","nickname":"EECS 4452","faculty":1,"credit":3,"lang":"En","about":"This course introduces fundamental concepts, principles and algorithms of digital signal processing (DSP), including DFT, FFT, digital filter design and analysis of digital systems. It also covers some selected DSP applications, such as embedded DSP system design, speech and audio processing, image processing, etc. Three lecture hours per week. Twelve supervised laboratory hours. Prerequisites: General prerequisite; LE/EECS 3451 4.00 or LE/EECS 3602 4.00. (NOTE: The General Prerequisite is a cumulative GPA of 4.50 or better over all major EECS courses. EECS courses with the second digit \"5\" are not major courses.)"},{"pk":51,"name":"Computer Use: Programming","code":"EECS1530","nickname":"EECS 1530","faculty":1,"credit":3,"lang":"En","about":"Concepts of computer systems and technology - e.g. software engineering, algorithms, programming languages, theory of computation. Practical work focuses on problem solving using a high-level programming language. The course requires extensive laboratory work. This course is designed for students who are not Computer Science majors, but may be used as preparation by those who wish to major in Computer Science but lack programming background. Course credit exclusions: LE/EECS 1540 3.00, LE/CSE 1540 3.00 (prior to Fall 2014), SC/CSE 1540 3.00 prior to Summer 2013). Previously offered as: LE/CSE 1530 3.00, SC/CSE 1530 3.00. NCR: any student who has passed or is taking LE/EECS 1020 3.00 or LE/CSE 1020 3.00 or SC/CSE 1020 3.00 or LE/EECS 1021 3.00 or LE/EECS 1022 3.00 or AP/ITEC 1620 3.00."},{"pk":52,"name":"Programming for Mobile Computing","code":"EECS1022","nickname":"EECS 1022","faculty":1,"credit":3,"lang":"En","about":"Provides a first exposure to object-oriented programming and enhances student understanding of key computing skills such as reasoning about algorithms, designing user interfaces, and working with software tools. It uses problem-based approach to expose the underlying concepts and an experiential laboratory to implement them. A mature mobile software infrastructure (such as Java and the Android programming environment) is used to expose and provide context to the underlying ideas. Laboratory exercises expose students to a range of real-world problems with a view of motivating computational thinking and grounding the material covered in lectures. Prerequisite: LE/EECS 1012 3.00. Course credit exclusions: LE/EECS 1021 3.00, LE/EECS 1020 3.00 (prior to Fall 2014), LE/CSE 1020 3.00 (prior to Fall 2014), SC/CSE 1020 3.00 (prior to Summer 2013), AP/ITEC 1620 3.00."},{"pk":53,"name":"Mathematics of Cryptography","code":"EECS4161","nickname":"EECS 4161","faculty":1,"credit":3,"lang":"En","about":"Probability, information theory and number theory and applications to cryptography. Classical codes such as Caesar shift, Vigenere, ADFGVX, rectangular substitution, and others. Other topics: comma free codes, perfect secrecy, index of coincidence, public key systems, primality testing and factorization algorithms. Prerequisites: At least 12 credits from 2000-level (or higher) MATH courses (without second digit \"5\", or second digit \"7\"); or LE/EECS 3101 3.00 or permission of the Instructor."},{"pk":54,"name":"Advanced Data Structures","code":"EECS4101","nickname":"EECS 4101","faculty":1,"credit":3,"lang":"En","about":"Amortized and worst-case analysis of data structures. Data structuring paradigms: self-adjustment and persistence. Lists: self-adjustment with the move-to-front heuristic. Search trees: splay trees, finger search trees. Heaps: skew heaps, Fibonacci heaps. Union-find trees. Link-and-cut trees. Multidimensional data structures and dynamization. Integrated with: GS/CSE 5101 3.00. Prerequisites: cumulative GPA of 4.50 or better over all major EECS courses (without second digit \"5\"); LE/EECS 2030 3.00 or LE/EECS 1030 3.00; LE/EECS 2001 3.00, LE/EECS 3101 3.00. Previously offered as: LE/CSE 4101 3.00. PRIOR TO SUMMER 2013: SC/CSE 4101 3.00."},{"pk":55,"name":"Computer Vision","code":"EECS4422","nickname":"EECS 4422","faculty":1,"credit":3,"lang":"En","about":"Fundamental concepts of Computer vision and including aspects of biological vision, image formation process, image processing, feature extraction and matching, 3-D parameter estimation, applications and statistical techniques. Prerequisites: cumulative GPA of 4.50 or better over all major EECS courses (without second digit \"5\"); LE/EECS 2030 3.00 or LE/EECS 1030 3.00; SC/MATH 1025 3.00; SC MATH 1310 3.00, LE/EECS 2031 3.00. Previously offered as: LE/CSE 4422 3.00."},{"pk":56,"name":"Computer Architecture","code":"EECS4201","nickname":"EECS 4201","faculty":1,"credit":3,"lang":"En","about":"The internal structure and design ideas embodied in many computers and the techniques for evaluating them. Fast arithmetic algorithms, memory system designs, pipeline techniques, input-output subsystems and parallel computing structures. Future trends in computer architecture. Prerequisites: cumulative GPA of 4.50 or better over all major EECS courses (without second digit \"5\"); LE/EECS 2030 3.00 or LE/EECS 1030 3.00; LE/EECS 3201 4.00, LE/EECS 3221 3.00. Previously offered as: LE/CSE 4201 3.00."},{"pk":57,"name":"Introduction to Medical Devices and Biological Instruments","code":"EECS4641","nickname":"EECS 4641","faculty":1,"credit":4,"lang":"En","about":"This course builds on the foundation in measurement techniques by developing the students' understanding of electrophysiological sensing systems and biosensors used within the medical and biological fields. This course applies the classical knowledge of electronic circuits and systems techniques to the development of medical devices and biological instruments. Background in electronic circuit design, basic knowledge of human physiology and body system, and basic knowledge of cellular and molecular biology are required before taking the course. Topics include the design of medical devices such as Electro-Encephalography (EEG) and Electromyography (EMG) devices used for disease diagnostics; biological instruments such as cell counter; handheld sensing devices used for various point-of-care (PoC) applications such as glucose measurement, blood pressure monitoring and early detection of cancer; and wearable sensing devices used for fitness applications. In the design of each medical device or biological instrument, students are also introduced the related theoretical and practical issues with a focus on needs assessment, creativity, and innovation as they seek to identify market opportunities. Prerequisites: cumulative GPA of 4.50 or better over all major EECS courses (without second digit \"5\"); LE/EECS 2030 3.00 or LE/EECS 1030 3.00; LE/EECS 2210 4.00, LE/EECS 3215 4.00, SC/BIOL 1000 3.00."},{"pk":58,"name":"Software Engineering Testing","code":"EECS4313","nickname":"EECS 4313","faculty":1,"credit":3,"lang":"En","about":"An introduction to systematic methods of testing and verification, covering a range of static and dynamic techniques and their use within the development process; emphasizes the view that design should be carried out with verification in mind to achieve overall project goals. Prerequisites: cumulative GPA of 4.50 or better over all major EECS courses (without second digit \"5\"); LE/EECS 2030 3.00 or LE/EECS 1030 3.00; LE/EECS 3311 3.00. Previously offered as: LE/CSE 4313 3.00."},{"pk":59,"name":"Digital Very Large Scale Integration","code":"EECS4612","nickname":"EECS 4612","faculty":1,"credit":4,"lang":"En","about":"An introductory course on the design of VLSI CMOS chips. Key elements of complex digital system design are presented including nanoscale MOS fundamentals, CMOS combinational and sequential logic design, datapath and control system design, memories, testing, packaging, l/O, scalability, reliability, and IC design economics. Prerequisites: cumulative GPA of 4.50 or better over all major EECS courses (without second digit \"5\"); LE/EECS 2030 3.00 or LE/EECS 1030 3.00; LE/EECS 2200 3.00, LE/EECS 2210 3.00, LE/EECS 3201 4.00."},{"pk":60,"name":"Database Management Systems","code":"EECS4411","nickname":"EECS 4411","faculty":1,"credit":3,"lang":"En","about":"A study of principles of database management systems. A thorough analysis of theory of normal, relational algebra and calculus and query languages based on these concepts. Other topics: security and integrity issues, concurrency control, distributed systems, query optimization. Prerequisites: cumulative GPA of 4.50 or better over all major EECS courses (without second digit \"5\"); LE/EECS 2030 3.00 or LE/EECS 1030 3.00; LE/EECS 2011 3.00; LE/EECS 2021 4.00, LE/EECS 2031 3.00, LE/EECS 3421 3.00. Previously offered as: LE/CSE 4411 3.00."},{"pk":61,"name":"Computer Organization","code":"EECS2021","nickname":"EECS 2021","faculty":1,"credit":4,"lang":"En","about":"Introduction to computer organization and instruction set architecture, covering assembly language, machine language and encoding, addressing modes, single/multicycle datapaths (including functional units and controls), pipelining, memory segments and memory hierarchy. Prerequisites: cumulative GPA of 4.50 or better over all major EECS courses (without second digit \"5\"); LE/EECS 1021 3.00 or LE/EECS 1022 3.00 or LE/EECS 1720 3.00 or LE/EECS 1030 3.00. Previously offered as: LE/CSE 2021 4.00, SC/CSE 2021 4.00."},{"pk":62,"name":"User Interfaces","code":"EECS3461","nickname":"EECS 3461","faculty":1,"credit":3,"lang":"En","about":"Introduces user interfaces and the tools and mechanisms to create and prototype them. Students work in small groups and learn how to design user interfaces, how to realize them and how to evaluate the end result. Prerequisite: cumulative GPA of 4.50 or better over all major EECS courses (without second digit \"5\"); LE/EECS 2030 3.00 or LE/EECS 1030 3.00. Course credit exclusions: AP/ITEC 3230 3.00. Previously offered as: LE/CSE 3461 3.00. PRIOR TO SUMMER 2013: SC/CSE 3461 3.00."},{"pk":63,"name":"Object Oriented Programming from Sensors to Actuators","code":"EECS1021","nickname":"EECS 1021","faculty":1,"credit":3,"lang":"En","about":"\"Introduces student to computational thinking - a process-based approach to problem solving. It uses a problem-based pedagogy to expose the underlying concepts and an experiential laboratory to implement them. The programming language is chosen so that it is widely used in a variety of applications, is object-oriented, and is of industrial strength (Java is an example of such a language). The problems are chosen in order to expose abstract programming concepts by immersing them in relevant and engaging applications. The experiential laboratory is based on sensors and actuators that connect to a computer. The problems are chosen with consultation with the various engineering disciplines in the Faculty with a view of exposing how computing is used in these disciplines. Prerequisites: LE/EECS1011 3.00. Course credit exclusions: LE/EECS 1022 3.00. Previously offered as: LE/EECS1020 3.00, LE/CSE 1020 3.00."},{"pk":64,"name":"Introduction to Machine Learning and Pattern Recognition","code":"EECS4404","nickname":"EECS 4404","faculty":1,"credit":3,"lang":"En","about":"Machine learning is the study of algorithms that learn how to perform a task from prior experience. This course introduces the student to machine learning concepts and techniques applied to pattern recognition problems in a diversity of application areas. Prerequisites: cumulative GPA of 4.50 or better over all major EECS courses (without second digit \"5\"); LE/EECS 2030 3.00 or LE/EECS 1030 3.00; one of SC/MATH 2030 3.00 or SC/MATH 2930 3.00 or SC/MATH 1131 3.00."},{"pk":65,"name":"Introduction to the Theory of Computation","code":"EECS2001","nickname":"EECS 2001","faculty":1,"credit":3,"lang":"En","about":"Introduction to the theory of computing, including automata theory, formal languages and Turing machines; theoretical models and their applications in various fields of computer science. The emphasis is on practical applications of the theory and concepts rather than formal rigour. Prerequisites: cumulative GPA of 4.50 or better over all major EECS courses (without second digit \"5\"); LE/EECS 1021 3.00 or LE/EECS 1022 3.00 or LE/EECS 1720 3.00 or LE/EECS 1030 3.00; LE/EECS 1028 3.00 or SC/MATH 1028 3.00 or LE/EECS 1019 3.00 or SC/MATH 1019 3.00. Previously offered as: LE/CSE 2001 3.00. PRIOR TO SUMMER 2013: SC/CSE 2001 3.00."},{"pk":66,"name":"Software Development Project","code":"EECS2311","nickname":"EECS 2311","faculty":1,"credit":3,"lang":"En","about":"This course allows students to develop a significant piece of software utilizing all the skills they have acquired so far. This includes requirement elicitation, system specification, implementation, testing, deployment, and user documentation. Prerequisites: cumulative GPA of 4.50 or better over all major EECS courses (without second digit \"5\"); LE/EECS 1030 3.00 or LE/EECS 2030 3.00."},{"pk":67,"name":"Fortran and Scientific Computing","code":"EECS2501","nickname":"EECS 2501","faculty":1,"credit":1,"lang":"En","about":"Covers computer-base problem solving in a variety of scientific and engineering settings. Introduces the FORTRAN programming language and its interface with scientific libraries. Applications are drawn mainly from scientific areas such as numerical methods, processing experimental data, simulation and data visualization. Prerequisites: cumulative GPA of 4.50 or better over all major EECS courses (EECS courses without second digit \"5\" are not major courses); One of LE/EECS 1020 3.00 or LE/EECS 1021 3.00 or LE/EECS 1022 3.00 or LE/EECS 1530 3.00."},{"pk":68,"name":"Software Tools","code":"EECS2031","nickname":"EECS 2031","faculty":1,"credit":3,"lang":"En","about":"Tools commonly used in the software development process: the C language; shell programming; filters and pipes; version control systems and \"make\"; debugging and testing. Prerequisites: General prerequisites; LE/EECS 1021 3.00 or LE/EECS 1022 3.00 or LE/EECS 1030 3.00"},{"pk":69,"name":"Introduction to Robotics","code":"EECS4421","nickname":"EECS 4421","faculty":1,"credit":3,"lang":"En","about":"An introduction to robotic manipulators and autonomous vehicles. The course covers the kinematics and dynamics of manipulators and autonomous platforms, robot sensors and navigation. Prerequisites: cumulative GPA of 4.50 or better over all major EECS courses (without second digit \"5\"); LE/EECS 2030 3.00 or LE/EECS 1030 3.00; SC/MATH 1025 3.00, SC/MATH 1310 3.00, LE/EECS 2031 3.00. Previously offered as: LE/CSE 4421 3.00."},{"pk":70,"name":"Mission-Critical Systems","code":"EECS4315","nickname":"EECS 4315","faculty":1,"credit":3,"lang":"En","about":"Theory and practical tools underlying deductive and algorithmic methods for ensuring the safety and correctness of mission critical systems (e.g. medical systems, nuclear reactors and train systems) with the practical ability to use verification tools to perform software certification. Prerequisites: cumulative GPA of 4.50 or better over all major EECS courses (without second digit \"5\"); LE/EECS 2030 3.00 or LE/EECS 1030 3.00; LE/EECS 3342 3.00."},{"pk":71,"name":"Artificial Intelligence","code":"EECS4401","nickname":"EECS 4401","faculty":1,"credit":3,"lang":"En","about":"This is a second course in Artificial intelligence that covers selected topics in this area such as: reasoning about action and planning, uncertain and fuzzy reasoning, knowledge representation, automated reasoning, non-monotonic reasoning and answer set programming, ontologies and description logic, local search methods, Markov decision processes, autonomous agents and multi-agent systems, machine learning, reasoning about beliefs and goals, and expert systems. Prerequisites: cumulative GPA of 4.50 or better over all major EECS courses (without second digit \"5\"); LE/EECS 2030 3.00 or LE/EECS 1030 3.00; LE/EECS 3401 3.00."},{"pk":72,"name":"Electromechanical Energy Conversion","code":"EECS3603","nickname":"EECS 3603","faculty":1,"credit":4,"lang":"En","about":"This course covers the basic construction and principles of operation of different types of electric machines; magnetic circuit analysis, single-phase and poly-phase transformers, principles of electromechanical energy conversion, DC machines, three-phase induction machines, synchronous machines, and special machines (stepper motors, linear motors and brushless DC (BLDC) motors). The transients and dynamics of machines are analyzed. Introduction of Solid-State control of motors. In addition to lectures and tutorials, field trip: six hours. Prerequisites: cumulative GPA of 4.50 or better over all major EECS courses (without second digit \"5\"); LE/EECS 2030 3.00 or LE/EECS 1030 3.00;LE/EECS 2200 3.00, SC/PHYS 2020 3.00."},{"pk":73,"name":"Mobile Communications","code":"EECS4215","nickname":"EECS 4215","faculty":1,"credit":3,"lang":"En","about":"Provides an overview of the latest developments and trends in wireless mobile communications, and addresses the impact of wireless transmission and user mobility on the design and management of wireless mobile systems. Prerequisites: cumulative GPA of 4.50 or better over all major EECS courses (without second digit \"5\"); LE/EECS 2030 3.00 or LE/EECS 1030 3.00; LE/EECS 3213 3.00."},{"pk":74,"name":"Computer Science Internship Work Term","code":"EECS3900","nickname":"EECS 3900","faculty":1,"credit":0,"lang":"En","about":"This experiential education course reflects the work term component of the Technology Internship Program (TIP). Qualified Honours students gain relevant work experience as an integrated complement to their academic studies, reflected in the requirements of a learning agreement and work term report. Students are required to register in this course for each four month work term, with the maximum number of work term courses being four (i.e. 16 months). Students in this course receive assistance from the Career Centre prior to and during their internship, and are also assigned a Faculty Supervisor/Committee. Prerequisites: Enrolment is by permission only. Criteria for permission include: 1. that students have successfully completed at least nine EECS or CSE credits at the 3000-level including LE/EECS 3311 3.00 or LE/CSE 3311 3.00 or SC/CSE 3311 3.00, with a GPA of at least 6.0 in all mathematics and computer science courses completed; 2. that students are enrolled full-time in the Honours program prior to beginning their internship and have attended the mandatory preparatory sessions as outlined by the Career Centre; 3. that students have not been absent for more than two consecutive years as a full-time student from their Honours degree studies; 4. that upon enrolling in this course students have a minimum of 9 credits remaining toward their Honours degree and need to return as a full-time student for at least one academic term to complete their degree after completion of their final work term. Registration in LE/EECS 3900 0.00 (formerly LE/CSE 3900 0.00, SC/CSE 3900 0.00) provides a record on the transcript for each work term."},{"pk":75,"name":"Semiconductor Physics and Devices","code":"EECS3610","nickname":"EECS 3610","faculty":1,"credit":4,"lang":"En","about":"This course is intended to teach students the basic working principles and modern challenges of semiconductor devices. The main topics will be: (i) Semiconductor physics, (ii) Diodes including p-nand metal-semiconductor junctions, (iii) Metal-oxide-semiconductor capacitors (MOSCAPs), (iv) Metaloxide-semiconductor field-effect transistors (MOSFETs) and related field-effect transistors, (v) Introduction to microfabrication illustrated by the basic MOSFET process, and (vi) State-of-the-art MOSFET scaling challenges and solutions such as high-k dielectrics, strain and FinFET in the context of the International Technology Roadmap for Semiconductors (ITRS) and its successor the International Roadmap for Devices and Systems (IRDS). The students use device simulation software to model device behavior. Prerequisites: A cumulative grade point average of 4.50 or better over all previously completed Major EECS courses; LE/EECS 2210 3.00 or SC/PHYS 3050 3.00"},{"pk":76,"name":"Software Engineering Requirements","code":"EECS4312","nickname":"EECS 4312","faculty":1,"credit":3,"lang":"En","about":"This course deals with the elicitation, specification and analysis of software requirements and provides a critical description of available methods and tools, and practical exercises on applying these methods and tools to realistic problems. Three lecture hours per week. One laboratory hour per week. One term. Three credits. Prerequisites: cumulative GPA of 4.50 or better over all major EECS courses (without second digit \"5\"); LE/EECS 2030 3.00 or LE/EECS 1030 3.00; LE/EECS 3311 3.00. Course credit exclusions: LE/CSE 4312 3.00, AK/AS/SC/CSE 4312 3.00."},{"pk":77,"name":"Power Electronics","code":"EECS4613","nickname":"EECS 4613","faculty":1,"credit":4,"lang":"En","about":"The objective of this course is to understand the basic operating principles of power conversion using advanced electronic devices. The structure and characteristics of several switching devices are reviewed. Basic power electronic converters and inverters such as AC/DC rectifiers, DC/DC switch mode converters and voltage source DC/AC inverters are studied. Resonant DC/DC converters are introduced. Computation of circuit quantities such as average and RMS value, average power, power factor, total harmonics distortion and power efficiency are also studied. Prerequisites: cumulative GPA of 4.50 or better over all major EECS courses (without second digit \"5\"); LE/EECS 2030 3.00 or LE/EECS 1030 3.00; LE/EECS 2210 3.00. Corequisite: LE/EECS 3603 4.00."},{"pk":78,"name":"Computer Science Project","code":"EECS4080","nickname":"EECS 4080","faculty":1,"credit":3,"lang":"En","about":"A project in computer science chosen in consultation with, and supervised by, a member of the department. Prerequisites: cumulative GPA of 4.50 or better over all major EECS courses (without second digit \"5\"); LE/EECS 2030 3.00 or LE/EECS 1030 3.00; permission of the Instructor. Normally restricted to students who have taken 36 credits in computer science. Course credit exclusions: LE/EECS 4081 6.00, LE/EECS 4082 6.00, LE/EECS 4084 6.00, LE/EECS 4088 6.00, LE/EECS 4480 6.00, LE/ENG 4000 6.00. PRIOR TO FALL 2014: Course credit exclusions: LE/CSE 4081 6.00, SC/CSE 4081 6.00, LE/CSE 4082 6.00, SC/CSE 4082 6.00, LE/CSE 4084 6.00, SC/CSE 4084 6.00, LE/CSE 4088 6.00, SC/CSE 4088 6.00, LE/CSE 4480 3.00, SC/CSE 4480. LE/EECS 4700 6.00, LE/CSE 4700 6.00, LE/ENG 4000 6.00, SC/ENG 4000 6.00."},{"pk":79,"name":"System Specification and Refinement","code":"EECS3342","nickname":"EECS 3342","faculty":1,"credit":3,"lang":"En","about":"Theory and tools for specifying computer systems (sequential, concurrent and embedded). Specification (via set theory and predicate logic), modelling, abstraction, refinement and formal reasoning are undertaken before code development so that systems are correct by construction under the stated assumptions. Prerequisites: cumulative GPA of 4.50 or better over all major EECS courses (without second digit \"5\"); LE/EECS 2030 3.00 or LE/EECS 1030 3.00; LE/EECS 2011 3.00; SC/MATH 1090 3.00."},{"pk":80,"name":"Net-centric Introduction to Computing","code":"EECS1012","nickname":"EECS 1012","faculty":1,"credit":3,"lang":"En","about":"The objectives of 1012 are threefold: providing a first exposure to event-driven programming, teaching students a set of computing skills (including reasoning about algorithms, tracing programs, test-driven development, unit testing), and providing an introduction to computing within a mobile, net-centric context. It uses problem-based approach to expose the underlying concepts and an experiential laboratory to implement them. A mature mobile software infrastructure (such as HTML, CSS, and JavaScript) is used so that students can pick up key programming concepts (such as variables and control flow) within a client-server context without being bogged down in complex or abstract constructs. Laboratory exercises expose students to a range of real-world problems with a view of motivating computational thinking and grounding the material covered in lecture. Prerequisites: One of (1)-(3) below must be met: (1) (New high school curriculum): One 4U Math course with a grade of at least 75%. (2) Completion of six credits from York University MATH courses (not including courses with second digit 5) with a GPA of 5.00 or better over these credits; (3) Completion of six credits from York University mathematics courses whose second digit is 5, with an average grade not below 7.00 (B+). Course credit exclusions: AP/ITEC 3020 3.00, SC/CSE 2041 4.00 (prior to Summer 2013) Previously offered as: LE/CSE 2041 4.00, LE/EECS 2041 4.00."},{"pk":81,"name":"Introductory Computational Bioinformatics","code":"EECS4425","nickname":"EECS 4425","faculty":1,"credit":3,"lang":"En","about":"An introduction to basic notions in molecular biology; sequence analysis algorithms; heuristic algorithms for search in biological databases; algorithms for the reconstruction of phylogenetic trees; algorithms for microarray data analysis for gene expression. Prerequisites: General prerequisite; LE/EECS 2030 3.00 or LE/EECS 1030 3.00; LE/EECS 2011 3.00. (NOTE: The General Prerequisite is a cumulative GPA of 4.50 or better over all major EECS courses. EECS courses with the second digit \"5\" are not major courses.)"},{"pk":82,"name":"Computer Network Protocols and Applications","code":"EECS3214","nickname":"EECS 3214","faculty":1,"credit":3,"lang":"En","about":"This course focuses on the higher-level network protocols, security issues, network programming, and applications. Prerequisites: cumulative GPA of 4.50 or better over all major EECS courses (without second digit \"5\"); LE/EECS 2030 3.00 or LE/EECS 1030 3.00; NCR: This course is not open for credit to students who passed LE/EECS 4213 3.00, LE/CSE 4213 3.00, SC/CSE 4213 3.00, LE/CSE 4213 3.00, SC/CSE 4213 3.00."},{"pk":83,"name":"Introduction to Artificial Intelligence and Logic Programming","code":"EECS3401","nickname":"EECS 3401","faculty":1,"credit":3,"lang":"En","about":"Artificial Intelligence (AI) deals with how to build intelligent systems. In this course, we examine fundamental concepts in AI: knowledge representation and reasoning, search, constraint satisfaction, reasoning under uncertainty, etc. The course also introduces logic programming and Prolog. Prerequisites: cumulative GPA of 4.50 or better over all major EECS courses (without second digit \"5\"); LE/EECS 2030 3.00 or LE/EECS 1030 3.00; LE/EECS 2011 3.00; MATH 1090 3.00. Previously offered as: LE/CSE 3401 3.00. PRIOR TO FALL 2014: course credit exclusion: LE/CSE 3402 3.00. PRIOR TO SUMMER 2013: course credit exclusions: SC/CSE 3401 3.00, SC/CSE 3402 3.00."},{"pk":84,"name":"Human-Computer Interaction","code":"EECS4441","nickname":"EECS 4441","faculty":1,"credit":3,"lang":"En","about":"Introduces the concepts and technology necessary to design, manage and implement interactive software. Students work in small groups and learn how to design user interfaces, how to realize them and how to evaluate the end result. Both design and evaluation are emphasized. Prerequisites: cumulative GPA of 4.50 or better over all major EECS courses (without second digit \"5\"); LE/EECS 2030 3.00 or LE/EECS 1030 3.00; LE/EECS 3461 3.00. Previously offered as: LE/CSE 4441 3.00."},{"pk":85,"name":"Electronic Circuits and Devices","code":"EECS2210","nickname":"EECS 2210","faculty":1,"credit":3,"lang":"En","about":"This course covers the basic material required in the design of both analog and digital electronic circuits. Diodes, transistors (both BJT and FET), amplifiers, rectifiers, frequency response, feedback amplifiers, switching circuits and introduction to VLSI. Prerequisites: cumulative GPA of 4.50 or better over all major EECS courses (without second digit \"5\"); LE/ENG 2200 3.00. Course credit exclusion: SC/PHYS 3150 3.00."},{"pk":86,"name":"Automata and Computability","code":"EECS4111","nickname":"EECS 4111","faculty":1,"credit":3,"lang":"En","about":"Introduction to more advanced topics in theoretical foundations of computer science, including the study of formal languages and automata, formal models of computation, and computational complexity measures. Integrated with: GS/CSE 5111 3.00. Prerequisites: cumulative GPA of 4.50 or better over all major EECS courses (without second digit \"5\"); LE/EECS 2030 3.00 or LE/EECS 1030 3.00; LE/EECS 2001 3.00, LE/EECS 3101 3.00. Previously offered as: LE/CSE 4111 3.00."},{"pk":87,"name":"Computational Complexity","code":"EECS4115","nickname":"EECS 4115","faculty":1,"credit":3,"lang":"En","about":"Study of time and space and other computational resources required for efficient solution of classes of computational problems, including P and NP, PSPACE. Proof techniques including diagonalization, simulation, reduction and completeness. Models of computation, nondeterminism, randomness. Intractability. Prerequisites: cumulative GPA of 4.50 or better over all major EECS courses (without second digit \"5\"); LE/EECS 2030 3.00 or LE/EECS 1030 3.00; LE/EECS 2001 3.00; LE/EECS 3101 3.00. Previously offered as: LE/CSE 4115 3.00."},{"pk":88,"name":"Introduction to Energy Systems","code":"EECS4622","nickname":"EECS 4622","faculty":1,"credit":4,"lang":"En","about":"Introduction to basic modeling and analysis techniques in electricity generation, transmission and distribution. Introduction to 3-phase systems, single line diagrams and Per Unit system of calculations. Functional descriptions and modeling of generators, transformers, transmission lines, motors and other loads are discussed. Load Flow study, Gauss-Seidel and Newton-Raphson iterative methods; Symmetrical fault analysis, symmetrical components, unsymmetrical fault analysis; introduction of protection relays and Circuit Breakers; power systems stability analysis; introduction to distribution systems and distributed generation. Prerequisites: cumulative GPA of 4.50 or better over all major EECS courses (without second digit \"5\"); LE/EECS 2030 3.00 or LE/EECS 1030 3.00; LE/EECS2200 3.00, LE/EECS3603 4.00, SC/PHY2020 3.00."},{"pk":89,"name":"Computer Use for the Natural Sciences","code":"EECS1540","nickname":"EECS 1540","faculty":1,"credit":3,"lang":"En","about":"Introduction to problem solving using computers - top down and modular design; implementation in a procedural programming language - control structures, data structures, subprograms; application to simple numerical methods, modelling and simulation in the sciences; use of library subprograms. Course credit exclusions: LE/EECS 1530 3.00. NCR: any student who has passed or is taking LE/EECS 1020 3.00, LE/CSE 1020 3.00 or LE/EECS 1021 3.00 or LE/EECS 1022 3.00 or AP/ITEC 1620 3.00. Previously offered as: LE/CSE 1540 3.00. PRIOR TO FALL 2014: course credit exclusions: LE/CSE 1530 3.00. PRIOR TO SUMMER 2013: course credit exclusions: SC/CSE 1540 3.00."},{"pk":90,"name":"Medical Imaging Systems","code":"EECS4642","nickname":"EECS 4642","faculty":1,"credit":4,"lang":"En","about":"This course will provide an introduction to several of the major imaging modalities ranging from X-ray projection radiography to magnetic resonance imaging (MRI). This course applies the classical knowledge of physics, circuits, and signal and systems techniques to the development of medical imaging systems. Background in medical devices, electronic circuit, signal and systems, basic knowledge of human physiology and body system, and basic knowledge of physics are required before taking the course. Topics include the physics of radiography; fundamental of X-ray projection radiography and X-ray computed tomography (CT); Fundamental of ultrasound imaging techniques and ultrasound imaging systems; and introduction of magnetic resonance imaging (MRI) system. Three lecture hours per week. Three laboratory hours per week. Prerequisites: General Prerequisite; LE/EECS 2030 3.00 or LE/EECS 1030 3.00; LE/ EECS 2210 3.00, LE/EECS 3602 4.00 or LE/EECS 3451 4.00. (NOTE: The General Prerequisite is a cumulative GPA of 4.50 or better over all major EECS courses. EECS courses with the second digit \"5\" are not major courses.)"},{"pk":91,"name":"Directed Studies","code":"EECS4070","nickname":"EECS 4070","faculty":1,"credit":3,"lang":"En","about":"By special arrangement, a student may carry out independent study in a specialized area of computer science or engineering under the direction of a member of the EECS department. The student will be expected to meet regularly with the supervisor throughout the term. In addition to regular meetings with the supervisor, a student is expected to do about 10 hours per week on reading and preparation of assigned work. Prerequisites: cumulative GPA of 4.50 or better over all major EECS courses (without second digit \"5\"); LE/EECS 2030 3.00 or LE/EECS 1030 3.00; successful completion of 24 credits in EECS and permission of course coordinator."},{"pk":92,"name":"Systems and Random Processes in Discrete Time","code":"EECS3602","nickname":"EECS 3602","faculty":1,"credit":4,"lang":"En","about":"Discrete signals are obtained by sampling continuous signals. Starting with a continuous time signal, the course reviews the concept of a discrete signal, the conditions under which a continuous signal is completely represented by its discrete version, and discusses the analysis and design of linear time-invariant, discrete-time systems. In particular, frequency selective filters in the discrete time domain are developed. The second half of the course will cover advanced topics of random processes, noise, and their applications in the real world including the effect of linear systems on the statistical properties of random signals. Prerequisites: General prerequisite;SC/MATH 2930 3.00; LE/EECS 2030 3.00 or LE/EECS 1030 3.00; LE/EECS 2602 4.00, LE/SC/CSE2602 4.00 Course credit exclusions: LE/SC/EECS 3451 4.00, LE/SC/CSE 3451 4.00."}]